{
  "data": [
    {
      "Domain": "Governance & Leadership", 
      "Master": "GL-1",
      "Topic": "Executive Commitment and Accountability",
      "Control Statement": "The organisation's executive leadership shall establish, document, and maintain formal accountability for AI governance through approved policies that align with organisational objectives and values. These policies shall be reviewed at planned intervals by executive leadership to ensure continued effectiveness and relevance. Executive leadership shall demonstrate active engagement in AI risk decisions and maintain ultimate accountability for the organisation's AI systems.",
      "ISO42001": "4.1 5.1 5.2 9.3 A.2.2 A.2.3 A.2.4",
      "ISO27001": "5.1 5.2 9.3 A.5.1 A.5.2",
      "ISO27701": "6.1.1 6.1.2",
      "EU AI ACT": "4.1",
      "NIST RMF": "Govern 1.1 Govern 2.3 Govern 3.1",
      "SOC2": "CC.1.1 CC.1.2 CC.1.3 CC.1.4 CC.1.5 CC.5.3",
      "Key control activities": "Establish and document an AI governance policy aligned with organizational objectives and values. - Review and update the policy at least annually. - Ensure executive leadership participates in AI risk decisions through regular meetings or reviews. - Assign ultimate accountability for AI systems to a specific executive role (e.g., Chief AI Officer).",
      "Required Evidence": "Approved AI governance policy (PDF format). - Policy review records, including dates, reviewers, and changes (PDF format). - Meeting minutes or decision logs showing executive involvement in AI risk decisions (PDF format). - Documentation of assigned accountability (e.g., organizational chart, role description, PDF format). - Storage: GRC system; Sample size: All governance documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the existence and accessibility of the AI governance policy. - Review policy review records for the past year to confirm annual updates. - Examine meeting minutes from the last three executive meetings to confirm AI risk decision involvement. - Confirm documentation assigns accountability to a specific executive role."
    },
    {
      "Domain": "Governance & Leadership",
      "Master": "GL-2",
      "Topic": "Roles, Responsibilities, and Competency",
      "Control Statement": "The organisation shall define and document clear roles and responsibilities for all personnel involved in the AI management system, ensuring competency requirements are established and maintained. Training programs shall be implemented to ensure personnel have the necessary skills and knowledge to perform their duties effectively, with regular competency assessments.",
      "ISO42001": "7.2 A.2.5",
      "ISO27001": "7.2 A.7.2",
      "ISO27701": "6.3.1 6.3.2",
      "EU AI ACT": null,
      "NIST RMF": "Govern 2.1",
      "SOC2": "CC.2.1",
      "Key control activities": "Document roles and responsibilities for AI management in the AI Roles and Responsibilities Matrix. - Establish competency requirements for each role in the Competency Framework. - Implement training programs using the AI Training Program, updated annually. - Conduct semi-annual competency assessments using the Competency Assessment Tool.",
      "Required Evidence": "AI Roles and Responsibilities Matrix (PDF format). - Competency Framework documentation (PDF format). - AI Training Program materials and completion records (PDF format, LMS reports). - Semi-annual Competency Assessment Tool reports (PDF format). - Storage: HR system; Sample size: All role and training documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the AI Roles and Responsibilities Matrix is documented and accessible. - Review the Competency Framework for role-specific requirements. - Confirm training completion for two AI-related roles using LMS records. - Examine the last two semi-annual Competency Assessment Tool reports for assessment results."
    },
    {
      "Domain": "Governance & Leadership",
      "Master": "GL-3",
      "Topic": "AI Strategy and Objectives",
      "Control Statement": "The organisation shall establish and document a formal AI strategy that aligns with its mission and objectives, ensuring integration with overall business strategy. The AI strategy shall define measurable objectives for AI system development, deployment, and management, with regular reviews to ensure continued alignment and effectiveness.",
      "ISO42001": "5.1 5.4 6.2",
      "ISO27001": "5.1 6.2",
      "ISO27701": null,
      "EU AI ACT": null,
      "NIST RMF": "Govern 1.2",
      "SOC2": "CC.1.1 CC.1.4",
      "Key control activities": "Develop an AI strategy document aligned with business objectives using the AI Strategy Template. - Define measurable AI objectives in the AI Objectives Framework. - Review the AI strategy annually using the Strategy Review Protocol. - Integrate AI objectives into business planning during quarterly reviews.",
      "Required Evidence": "AI Strategy Template document (PDF format). - AI Objectives Framework with measurable goals (PDF format). - Annual Strategy Review Protocol reports (PDF format). - Quarterly business planning meeting minutes integrating AI objectives (PDF format). - Storage: Strategic planning system; Sample size: All strategy documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the AI Strategy Template is documented and aligned with business objectives. - Review the AI Objectives Framework for measurable goals. - Examine the most recent annual Strategy Review Protocol report. - Confirm AI objectives integration in the last two quarterly business planning meeting minutes."
    },
    {
      "Domain": "Risk Management",
      "Master": "RM-1",
      "Topic": "Risk Management Framework and Governance",
      "Control Statement": "The organisation shall establish, document, and maintain a comprehensive risk management framework for AI systems, defining risk criteria, risk appetite, and governance structures. The framework shall integrate with the organisation's enterprise risk management processes and ensure executive oversight of AI-related risks.",
      "ISO42001": "6.1.1 6.1.2",
      "ISO27001": "6.1.1 6.1.2",
      "ISO27701": "A.5.4.1 A.5.4.2",
      "EU AI ACT": "9.1 9.2",
      "NIST RMF": "Govern 1.1 Govern 1.3",
      "SOC2": "CC.3.1 CC.3.2",
      "Key control activities": "Document the AI risk management framework in the AI Risk Management Policy. - Define risk criteria and appetite in the Risk Criteria Document. - Establish governance structures with defined roles in the Risk Governance Matrix. - Conduct quarterly risk framework reviews with executive oversight using the Risk Framework Review Template.",
      "Required Evidence": "AI Risk Management Policy (PDF format). - Risk Criteria Document (PDF format). - Risk Governance Matrix (PDF format). - Quarterly Risk Framework Review Template reports (PDF format). - Storage: GRC system; Sample size: All risk framework documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the AI Risk Management Policy is documented and accessible. - Review the Risk Criteria Document for defined criteria and appetite. - Confirm the Risk Governance Matrix assigns clear roles. - Examine the last two quarterly Risk Framework Review Template reports for executive oversight."
    },
    {
      "Domain": "Risk Management",
      "Master": "RM-2",
      "Topic": "Risk Identification and Impact Assessment",
      "Control Statement": "The organisation shall systematically identify and assess AI-related risks, including risks to fundamental rights, safety, and societal impacts. Risk assessments shall consider internal and external factors, including third-party dependencies, and document potential impacts and likelihood.",
      "ISO42001": "6.1.2",
      "ISO27001": "6.1.2",
      "ISO27701": "A.7.2.1 A.7.2.2",
      "EU AI ACT": "9.9",
      "NIST RMF": "Map 1.1 Map 1.2",
      "SOC2": "CC.3.2",
      "Key control activities": "Conduct risk identification workshops quarterly using the Risk Identification Framework. - Perform impact assessments for high-risk AI systems using the Impact Assessment Template. - Document third-party risks in the Third-Party Risk Register. - Review risk assessments semi-annually using the Risk Assessment Review Protocol.",
      "Required Evidence": "Risk Identification Framework workshop reports (PDF format). - Impact Assessment Template reports for high-risk systems (PDF format). - Third-Party Risk Register (Excel format). - Semi-annual Risk Assessment Review Protocol reports (PDF format). - Storage: GRC system; Sample size: All risk assessment documentation for the past 12 months.",
      "Control test plan and procedures": "Review the last two quarterly Risk Identification Framework workshop reports. - Verify Impact Assessment Template reports for two high-risk AI systems. - Confirm the Third-Party Risk Register includes relevant dependencies. - Examine the most recent semi-annual Risk Assessment Review Protocol report."
    },
    {
      "Domain": "Risk Management",
      "Master": "RM-3",
      "Topic": "Risk Treatment and Control Implementation",
      "Control Statement": "The organisation shall implement appropriate technical and organisational measures to address identified risks, ensuring controls are proportionate to risk levels and organisational risk tolerance. Risk treatment strategies shall be documented and prioritised based on impact and likelihood, with clear accountability for implementation. The organisation shall establish, document, and maintain a comprehensive quality management system (QMS) for the design, development, testing, and post-market monitoring of high-risk AI systems, ensuring compliance with regulatory requirements and continuous improvement. For continuously learning systems, feedback loops shall be monitored and controlled to prevent unintended risk amplification.",
      "ISO42001": "5.1 5.2 6.1.3 8.1-8.3 9.1",
      "ISO27001": "5.1 6.1.3 8.1-8.3",
      "ISO27701": "6.1.1 6.1.2 A.7.4.1 A.7.4.2 A.7.4.4 A.7.4.5",
      "EU AI ACT": "8.1 8.2 9.3 9.4 9.5 15.1 17.1 17.2 43.1-43.4",
      "NIST RMF": "Govern 1.1 Govern 3.1 Manage 1.2 Manage 1.3 Manage 1.4",
      "SOC2": "CC1.1 CC1.4 CC4.1 CC5.1 CC9.1",
      "Key control activities": "Develop risk treatment plans prioritizing high-impact risks using the Risk Treatment Plan Template. - Deploy technical (e.g., encryption) and organizational (e.g., training) controls proportionate to risk levels. - Assign accountability for risk treatment to specific roles (e.g., AI Risk Officer). - Conduct quarterly risk treatment effectiveness reviews using the Risk Treatment Review Template. - For continuously learning systems, deploy automated feedback loop monitoring tools, reviewed monthly using the Feedback Loop Monitoring Protocol. - Establish a QMS aligned with ISO 9001 using the Quality Management Framework, approved by the Quality Manager. - Integrate QMS requirements into AI projects using the Quality Integration Checklist, verified at project milestones. - Conduct quarterly QMS effectiveness reviews using the Quality Review Template. - Perform annual QMS audits using the QMS Audit Protocol. - Assign QMS roles (e.g., Quality Manager) and hold semi-annual executive oversight meetings for QMS performance.",
      "Required Evidence": "Risk Treatment Plan Templates with prioritization details (PDF format). - Control implementation documentation (e.g., system configurations, training records, PDF format). - Accountability assignment records (e.g., responsibility matrices, PDF format). - Quarterly Risk Treatment Review Template reports (PDF format). - Monthly Feedback Loop Monitoring Protocol reports, including anomaly detection logs (PDF format). - Quality Management Framework documentation (PDF format). - Quality Integration Checklists for AI projects (PDF format). - Quarterly Quality Review Template reports (PDF format). - Annual QMS Audit Protocol reports (PDF format). - QMS role assignment documentation (PDF format). - Semi-annual executive oversight meeting minutes for QMS (PDF format). - Storage: GRC system; Sample size: All documentation for the past 12 months.",
      "Control test plan and procedures": "Select two high-impact risks and verify Risk Treatment Plan Templates exist. - Review system configurations and training records for control implementation. - Confirm accountability assignments via responsibility matrices. - Examine the last two quarterly Risk Treatment Review Template reports. - For one continuously learning system, review the last three monthly Feedback Loop Monitoring Protocol reports. - Verify the Quality Management Framework is documented and approved. - Check Quality Integration Checklists for two AI projects. - Review the last two quarterly Quality Review Template reports. - Examine the most recent annual QMS Audit Protocol report. - Confirm QMS role assignments and semi-annual executive oversight meeting minutes."
    },
    {
      "Domain": "Risk Management",
      "Master": "RM-4",
      "Topic": "Risk Monitoring and Response",
      "Control Statement": "The organisation shall continuously monitor AI-related risks and maintain processes for timely risk response and escalation. Monitoring shall include regular reviews of risk treatment effectiveness and emerging risks, with documented response plans for high-priority risks.",
      "ISO42001": "6.1.4",
      "ISO27001": "6.1.4",
      "ISO27701": "A.7.4.3",
      "EU AI ACT": "9.6",
      "NIST RMF": "Monitor 1.1 Monitor 1.2",
      "SOC2": "CC.9.2",
      "Key control activities": "Implement continuous risk monitoring using the Risk Monitoring Dashboard. - Conduct monthly risk treatment effectiveness reviews using the Risk Effectiveness Template. - Document emerging risks in the Emerging Risk Register. - Develop response plans for high-priority risks using the Risk Response Plan Template, reviewed quarterly.",
      "Required Evidence": "Risk Monitoring Dashboard configuration and logs (System logs). - Monthly Risk Effectiveness Template reports (PDF format). - Emerging Risk Register (Excel format). - Quarterly Risk Response Plan Template reports (PDF format). - Storage: GRC system; Sample size: All monitoring documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Risk Monitoring Dashboard is operational and captures AI risks. - Review the last three monthly Risk Effectiveness Template reports. - Confirm the Emerging Risk Register includes recent risks. - Examine the last two quarterly Risk Response Plan Template reports for high-priority risks."
    },
    {
      "Domain": "Regulatory Operations",
      "Master": "RO-1",
      "Topic": "Regulatory Compliance Framework",
      "Control Statement": "The organisation shall establish and maintain a regulatory compliance framework to ensure AI systems adhere to applicable laws, regulations, and standards. The framework shall include processes for monitoring regulatory changes, conducting compliance assessments, and maintaining evidence of compliance.",
      "ISO42001": "4.2 9.1",
      "ISO27001": "A.18.1",
      "ISO27701": "6.2.1",
      "EU AI ACT": "20.1 43.1-43.4",
      "NIST RMF": "Govern 3.2",
      "SOC2": "CC.3.1",
      "Key control activities": "Document the regulatory compliance framework in the Compliance Policy. - Monitor regulatory changes monthly using the Regulatory Tracking Tool. - Conduct quarterly compliance assessments using the Compliance Assessment Checklist. - Maintain compliance evidence in the Compliance Evidence Repository.",
      "Required Evidence": "Compliance Policy document (PDF format). - Monthly Regulatory Tracking Tool reports (PDF format). - Quarterly Compliance Assessment Checklist reports (PDF format). - Compliance Evidence Repository records (PDF format). - Storage: Compliance system; Sample size: All compliance documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Compliance Policy is documented and accessible. - Review the last three monthly Regulatory Tracking Tool reports. - Examine the last two quarterly Compliance Assessment Checklist reports. - Confirm the Compliance Evidence Repository contains relevant evidence."
    },
    {
      "Domain": "Regulatory Operations",
      "Master": "RO-2",
      "Topic": "Transparency, Disclosure, and Reporting",
      "Control Statement": "The organisation shall ensure transparency in AI system operations by implementing mechanisms for disclosure of AI usage, capabilities, and limitations to stakeholders. Regular reporting shall be conducted to meet regulatory requirements and inform affected parties.",
      "ISO42001": "7.4 A.6.2.7",
      "ISO27001": "7.4",
      "ISO27701": "A.7.3.2 A.7.3.3",
      "EU AI ACT": "50.1-50.5 86.1-86.3",
      "NIST RMF": "Map 1.2",
      "SOC2": "CC.2.2",
      "Key control activities": "Develop disclosure mechanisms using the Disclosure Template. - Conduct monthly transparency reviews using the Transparency Review Checklist. - Publish quarterly transparency reports using the Transparency Report Template. - Engage stakeholders annually using the Stakeholder Engagement Protocol.",
      "Required Evidence": "Disclosure Template documentation (PDF format). - Monthly Transparency Review Checklist reports (PDF format). - Quarterly Transparency Report Template reports (PDF format). - Annual Stakeholder Engagement Protocol reports (PDF format). - Storage: Compliance system; Sample size: All transparency documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Disclosure Template is implemented for two AI systems. - Review the last three monthly Transparency Review Checklist reports. - Examine the last two quarterly Transparency Report Template reports. - Confirm the most recent annual Stakeholder Engagement Protocol report."
    },
    {
      "Domain": "Regulatory Operations",
      "Master": "RO-3",
      "Topic": "Record-Keeping",
      "Control Statement": "The organisation shall maintain comprehensive records of AI system development, deployment, and operations, including technical documentation, compliance assessments, and monitoring evidence. Records shall be retained for regulatory retention periods and made available to authorities when required.",
      "ISO42001": "7.5 A.6.2.8",
      "ISO27001": "A.12.6",
      "ISO27701": "12.2.2",
      "EU AI ACT": "12.1-12.3 19.1-19.2",
      "NIST RMF": "Govern 4.3",
      "SOC2": "CC.4.1",
      "Key control activities": "Implement a record-keeping system using the Record-Keeping Framework. - Conduct monthly record completeness reviews using the Record Completeness Checklist. - Verify record retention compliance quarterly using the Retention Compliance Template. - Test record accessibility for authorities annually using the Regulatory Access Protocol.",
      "Required Evidence": "Record-Keeping Framework configuration documentation (PDF format). - Monthly Record Completeness Checklist reports (PDF format). - Quarterly Retention Compliance Template reports (PDF format). - Annual Regulatory Access Protocol test results (PDF format). - Storage: Secure repository; Sample size: All record-keeping documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Record-Keeping Framework is configured for two AI systems. - Review the last three monthly Record Completeness Checklist reports. - Examine the last two quarterly Retention Compliance Template reports. - Test record accessibility using the Regulatory Access Protocol."
    },
    {
      "Domain": "Regulatory Operations",
      "Master": "RO-4",
      "Topic": "Post-Market Monitoring",
      "Control Statement": "The organisation shall implement post-market monitoring processes to evaluate AI system performance and compliance after deployment. Monitoring shall include regular reviews of system behavior, stakeholder feedback, and incident reports, with documented corrective actions for identified issues.",
      "ISO42001": "9.2 A.10.2",
      "ISO27001": "A.12.7",
      "ISO27701": "12.2.3",
      "EU AI ACT": "72.1-72.3",
      "NIST RMF": "Monitor 2.1 Monitor 2.2",
      "SOC2": "CC.8.1",
      "Key control activities": "Implement post-market monitoring using the Post-Market Monitoring Framework. - Conduct monthly performance reviews using the Performance Review Template. - Collect stakeholder feedback quarterly using the Stakeholder Feedback Survey. - Review incident reports monthly using the Incident Review Protocol.",
      "Required Evidence": "Post-Market Monitoring Framework documentation (PDF format). - Monthly Performance Review Template reports (PDF format). - Quarterly Stakeholder Feedback Survey results (PDF format). - Monthly Incident Review Protocol reports (PDF format). - Storage: Monitoring system; Sample size: All monitoring documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Post-Market Monitoring Framework is implemented for two AI systems. - Review the last three monthly Performance Review Template reports. - Examine the most recent quarterly Stakeholder Feedback Survey results. - Confirm the last three monthly Incident Review Protocol reports."
    },
    {
      "Domain": "System, Data and Model Lifecycle",
      "Master": "LC-1",
      "Topic": "Data Quality and Governance",
      "Control Statement": "The organisation shall establish and maintain data governance processes to ensure AI systems use high-quality, relevant, and representative data. This includes data quality assessments, bias detection, and documentation of data provenance and lineage.",
      "ISO42001": "A.6.2.1 A.6.2.2",
      "ISO27001": "A.8.2",
      "ISO27701": "A.7.2.3 A.7.2.4",
      "EU AI ACT": "10.1-10.6",
      "NIST RMF": "Map 2.3",
      "SOC2": "CC.6.1",
      "Key control activities": "Implement data governance processes using the Data Governance Framework. - Conduct monthly data quality assessments using the Data Quality Checklist. - Perform quarterly bias detection using the Bias Detection Tool. - Document data provenance and lineage in the Data Lineage Register.",
      "Required Evidence": "Data Governance Framework documentation (PDF format). - Monthly Data Quality Checklist reports (PDF format). - Quarterly Bias Detection Tool reports (PDF format). - Data Lineage Register (Excel format). - Storage: Data management system; Sample size: All data governance documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Data Governance Framework is documented and implemented. - Review the last three monthly Data Quality Checklist reports. - Examine the last two quarterly Bias Detection Tool reports. - Confirm the Data Lineage Register includes data provenance for two AI systems."
    },
    {
      "Domain": "System, Data and Model Lifecycle",
      "Master": "LC-2",
      "Topic": "System Development and Lifecycle Management",
      "Control Statement": "The organisation shall implement processes for responsible AI system development, including requirements definition, design, testing, and validation. Lifecycle management shall ensure systems remain compliant and effective throughout their operational life.",
      "ISO42001": "A.6.2.3 A.6.2.4",
      "ISO27001": "A.14.1 A.14.2",
      "ISO27701": null,
      "EU AI ACT": "8.1 8.2",
      "NIST RMF": "Map 2.1 Map 2.2",
      "SOC2": "CC.7.1",
      "Key control activities": "Document development processes in the System Development Framework. - Conduct requirements reviews using the Requirements Review Checklist. - Perform testing and validation for each release using the Validation Protocol. - Review lifecycle management quarterly using the Lifecycle Management Template.",
      "Required Evidence": "System Development Framework documentation (PDF format). - Requirements Review Checklist reports (PDF format). - Validation Protocol reports for each release (PDF format). - Quarterly Lifecycle Management Template reports (PDF format). - Storage: Development system; Sample size: All development documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the System Development Framework is documented. - Review the Requirements Review Checklist for one recent system. - Confirm Validation Protocol reports for two recent releases. - Examine the last two quarterly Lifecycle Management Template reports."
    },
    {
      "Domain": "System, Data and Model Lifecycle",
      "Master": "LC-3",
      "Topic": "Resource Management",
      "Control Statement": "The organisation shall ensure adequate resources (human, technical, and financial) are allocated to AI system development, deployment, and maintenance to ensure compliance and performance. Resource allocation shall be reviewed regularly to address emerging needs.",
      "ISO42001": "7.1",
      "ISO27001": "7.1",
      "ISO27701": null,
      "EU AI ACT": null,
      "NIST RMF": "Govern 2.2",
      "SOC2": "CC.1.2",
      "Key control activities": "Document resource allocation in the Resource Allocation Plan. - Conduct quarterly resource reviews using the Resource Review Template. - Allocate resources for compliance activities in the Compliance Resource Plan. - Monitor resource utilization monthly using the Resource Utilization Dashboard.",
      "Required Evidence": "Resource Allocation Plan (PDF format). - Quarterly Resource Review Template reports (PDF format). - Compliance Resource Plan (PDF format). - Monthly Resource Utilization Dashboard reports (PDF format). - Storage: Resource management system; Sample size: All resource documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Resource Allocation Plan is documented. - Review the last two quarterly Resource Review Template reports. - Confirm the Compliance Resource Plan includes compliance activities. - Examine the last three monthly Resource Utilization Dashboard reports."
    },
    {
      "Domain": "System, Data and Model Lifecycle",
      "Master": "LC-4",
      "Topic": "Technical Documentation",
      "Control Statement": "The organisation shall maintain comprehensive technical documentation for AI systems, including system design, development processes, validation results, and operational characteristics. Documentation shall be updated regularly and made available to authorities when required.",
      "ISO42001": "7.5 A.6.2.5",
      "ISO27001": "A.12.6",
      "ISO27701": null,
      "EU AI ACT": "11.1-11.3",
      "NIST RMF": "Govern 4.3",
      "SOC2": "CC.4.1",
      "Key control activities": "Document technical details in the Technical Documentation Framework. - Update documentation for each system release using the Documentation Update Checklist. - Conduct quarterly documentation completeness reviews using the Documentation Review Template. - Test documentation accessibility annually using the Regulatory Access Protocol.",
      "Required Evidence": "Technical Documentation Framework (PDF format). - Documentation Update Checklist reports for each release (PDF format). - Quarterly Documentation Review Template reports (PDF format). - Annual Regulatory Access Protocol test results (PDF format). - Storage: Documentation system; Sample size: All documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Technical Documentation Framework is implemented for two AI systems. - Review Documentation Update Checklists for two recent releases. - Examine the last two quarterly Documentation Review Template reports. - Test documentation accessibility using the Regulatory Access Protocol."
    },
    {
      "Domain": "System, Data and Model Lifecycle",
      "Master": "LC-5",
      "Topic": "Change Management",
      "Control Statement": "The organisation shall implement change management processes to ensure AI system modifications are controlled, tested, and documented. Changes shall be assessed for compliance and risk impacts before deployment.",
      "ISO42001": "8.3",
      "ISO27001": "A.12.5",
      "ISO27701": null,
      "EU AI ACT": null,
      "NIST RMF": "Manage 2.1",
      "SOC2": "CC.7.1",
      "Key control activities": "Document change management processes in the Change Management Framework. - Assess changes for compliance and risk using the Change Assessment Template. - Test changes before deployment using the Change Testing Protocol. - Review change management quarterly using the Change Management Review Template.",
      "Required Evidence": "Change Management Framework documentation (PDF format). - Change Assessment Template reports (PDF format). - Change Testing Protocol reports (PDF format). - Quarterly Change Management Review Template reports (PDF format). - Storage: Change management system; Sample size: All change documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Change Management Framework is documented. - Review Change Assessment Template reports for two recent changes. - Confirm Change Testing Protocol reports for those changes. - Examine the last two quarterly Change Management Review Template reports."
    },  
    {
      "Domain": "Security",
      "Master": "SE-1",
      "Topic": "Security Governance, Architecture, and Engineering",
      "Control Statement": "The organisation shall establish a security governance framework to ensure AI systems are designed, developed, and operated with robust security measures. This includes defining security architectures, conducting risk-based security engineering, and maintaining continuous security monitoring.",
      "ISO42001": null,
      "ISO27001": "A.5.1 A.6.1 A.8.1",
      "ISO27701": "6.2.2",
      "EU AI ACT": null,
      "NIST RMF": "Govern 3.3",
      "SOC2": "CC.6.1",
      "Key control activities": "Document the security governance framework in the Security Governance Policy. - Define security architectures in the Security Architecture Blueprint. - Conduct quarterly security engineering reviews using the Security Engineering Review Template. - Implement continuous monitoring using the Security Monitoring Dashboard.",
      "Required Evidence": "Security Governance Policy (PDF format). - Security Architecture Blueprint (PDF format). - Quarterly Security Engineering Review Template reports (PDF format). - Security Monitoring Dashboard logs (System logs). - Storage: Security system; Sample size: All security governance documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Security Governance Policy is documented. - Review the Security Architecture Blueprint for two AI systems. - Examine the last two quarterly Security Engineering Review Template reports. - Confirm the Security Monitoring Dashboard is operational."
    },
    {
      "Domain": "Security",
      "Master": "SE-2",
      "Topic": "Identity and Access Management",
      "Control Statement": "The organisation shall implement identity and access management (IAM) controls to ensure only authorised personnel access AI systems and data. This includes strong authentication, role-based access, and regular access reviews.",
      "ISO42001": null,
      "ISO27001": "A.9.1 A.9.2 A.9.4",
      "ISO27701": "9.2.1 9.2.2",
      "EU AI ACT": null,
      "NIST RMF": null,
      "SOC2": "CC.6.2",
      "Key control activities": "Implement IAM controls using the IAM Framework. - Enforce strong authentication using the Authentication Protocol. - Assign role-based access in the Access Control Matrix. - Conduct quarterly access reviews using the Access Review Template.",
      "Required Evidence": "IAM Framework documentation (PDF format). - Authentication Protocol configuration (PDF format). - Access Control Matrix (Excel format). - Quarterly Access Review Template reports (PDF format). - Storage: IAM system; Sample size: All IAM documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the IAM Framework is implemented. - Review the Authentication Protocol configuration. - Confirm the Access Control Matrix assigns role-based access for two AI systems. - Examine the last two quarterly Access Review Template reports."
    },
    {
      "Domain": "Security",
      "Master": "SE-3",
      "Topic": "Software Security",
      "Control Statement": "The organisation shall ensure all software development and deployment activities follow secure development practices throughout the system development lifecycle. This includes implementing secure coding standards, conducting security testing, managing secure configurations, and maintaining robust change management procedures for all production systems. The organisation shall regularly assess applications for security vulnerabilities, including AI-specific threats such as model poisoning and adversarial attacks, and maintain secure development environments.",
      "ISO42001": null,
      "ISO27001": "A.14.1 A.14.2 A.12.2",
      "ISO27701": "14.2.1 14.2.2",
      "EU AI ACT": "15.5",
      "NIST RMF": null,
      "SOC2": "CC5.2 CC7.1",
      "Key control activities": "Implement secure coding standards using the Secure Coding Guideline, verified before code commits. - Conduct weekly security testing, including AI-specific threat tests (e.g., model poisoning, adversarial attacks) using the AI Security Testing Framework. - Verify secure configurations for each release using the Secure Configuration Checklist. - Perform monthly vulnerability assessments, including AI-specific vulnerabilities, using the Vulnerability Management Tool. - Maintain secure development environments with restricted access, audited quarterly using the Development Environment Audit Tool. - Document change management procedures with security approvals using the Change Management Log.",
      "Required Evidence": "Secure Coding Guideline documentation with verification records (PDF format). - Weekly AI Security Testing Framework reports, including model poisoning and adversarial attack results (PDF format). - Secure Configuration Checklists for each release (PDF format). - Monthly Vulnerability Management Tool reports, including AI-specific vulnerabilities (PDF format). - Quarterly Development Environment Audit Tool reports (PDF format). - Change Management Logs with security approvals (PDF format). - Storage: Secure repository; Sample size: All security documentation for the past 6 months.",
      "Control test plan and procedures": "Select three recent code commits and verify adherence to Secure Coding Guidelines. - Review the last four weekly AI Security Testing Framework reports for AI-specific threat testing. - For two recent releases, verify Secure Configuration Checklists were completed. - Examine the last two monthly Vulnerability Management Tool reports for AI-specific vulnerabilities. - Review the most recent quarterly Development Environment Audit Tool report for access controls. - Verify Change Management Logs include security approvals."
    },
    {
      "Domain": "Security",
      "Master": "SE-4",
      "Topic": "Data Security",
      "Control Statement": "The organisation shall implement data security controls to protect AI system data from unauthorized access, modification, or loss. This includes encryption, secure data handling, and regular security assessments.",
      "ISO42001": null,
      "ISO27001": "A.8.2 A.8.3",
      "ISO27701": "8.2.1 8.2.2",
      "EU AI ACT": null,
      "NIST RMF": null,
      "SOC2": "CC.6.1",
      "Key control activities": "Implement data encryption using the Data Encryption Protocol. - Establish secure data handling procedures in the Data Handling Guideline. - Conduct quarterly data security assessments using the Data Security Assessment Template. - Monitor data access logs monthly using the Data Access Monitoring Tool.",
      "Required Evidence": "Data Encryption Protocol configuration (PDF format). - Data Handling Guideline documentation (PDF format). - Quarterly Data Security Assessment Template reports (PDF format). - Monthly Data Access Monitoring Tool reports (PDF format). - Storage: Security system; Sample size: All data security documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Data Encryption Protocol is configured for two AI systems. - Review the Data Handling Guideline for secure procedures. - Examine the last two quarterly Data Security Assessment Template reports. - Confirm the last three monthly Data Access Monitoring Tool reports."
    },
    {
      "Domain": "Security",
      "Master": "SE-5",
      "Topic": "Network Security",
      "Control Statement": "The organisation shall implement network security controls to protect AI systems from unauthorized access and attacks. This includes network segmentation, intrusion detection, and regular network security assessments.",
      "ISO42001": null,
      "ISO27001": "A.13.1 A.13.2",
      "ISO27701": "13.2.1",
      "EU AI ACT": null,
      "NIST RMF": null,
      "SOC2": "CC.6.6",
      "Key control activities": "Implement network segmentation using the Network Segmentation Plan. - Deploy intrusion detection systems using the Intrusion Detection Framework. - Conduct quarterly network security assessments using the Network Security Assessment Template. - Monitor network traffic monthly using the Network Traffic Monitoring Tool.",
      "Required Evidence": "Network Segmentation Plan (PDF format). - Intrusion Detection Framework configuration (PDF format). - Quarterly Network Security Assessment Template reports (PDF format). - Monthly Network Traffic Monitoring Tool reports (PDF format). - Storage: Network security system; Sample size: All network security documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Network Segmentation Plan is implemented for two AI systems. - Review the Intrusion Detection Framework configuration. - Examine the last two quarterly Network Security Assessment Template reports. - Confirm the last three monthly Network Traffic Monitoring Tool reports."
    },

    {
      "Domain": "Safe Responsible AI",
      "Master": "RS-1",
      "Topic": "Human Oversight",
      "Control Statement": "The organisation shall implement appropriate human oversight mechanisms for AI systems to ensure continuous monitoring, evaluation, and intervention capabilities throughout the system lifecycle. This includes clear procedures for human review of AI decisions, effective intervention mechanisms to override or modify outputs, and regular assessment of oversight effectiveness. The organisation shall ensure that personnel responsible for oversight are adequately trained to understand system behavior and intervene effectively.",
      "ISO42001": "A.5.1 A.9.2",
      "ISO27001": null,
      "ISO27701": "7.2.2",
      "EU AI ACT": "14.1-14.5",
      "NIST RMF": "Govern 4.1 Measure 2.8",
      "SOC2": "CC2.1 CC2.2",
      "Key control activities": "Deploy real-time oversight dashboards for monitoring AI outputs, configured by the AI Operations team. - Establish human review procedures for high-risk decisions in the Oversight Procedure Manual. - Implement intervention mechanisms (e.g., manual override interfaces), tested quarterly using the Intervention Testing Protocol. - Conduct monthly oversight effectiveness reviews using the Oversight Effectiveness Checklist. - Provide annual training for oversight personnel on system behavior and intervention using the AI Oversight Training Program. - Maintain monthly intervention logs for high-risk systems.",
      "Required Evidence": "Oversight dashboard configuration documentation (PDF format). - Oversight Procedure Manual (PDF format). - Quarterly Intervention Testing Protocol reports (PDF format). - Monthly Oversight Effectiveness Checklist reports (PDF format). - AI Oversight Training Program materials and completion records (PDF format, LMS reports). - Monthly intervention logs for high-risk systems (System logs). - Storage: GRC system; Sample size: All oversight documentation for the past 12 months.",
      "Control test plan and procedures": "Verify oversight dashboards are operational for two AI systems. - Review the Oversight Procedure Manual for high-risk decision processes. - Test intervention mechanisms for one high-risk system using the Intervention Testing Protocol. - Examine the last three monthly Oversight Effectiveness Checklist reports. - Confirm training completion for oversight personnel via LMS records. - Review intervention logs for one high-risk system over the past three months."
    },
    {
      "Domain": "Safe Responsible AI",
      "Master": "RS-2",
      "Topic": "Prevention of Harm",
      "Control Statement": "The organisation shall implement measures to prevent harm from AI systems, including safeguards against misuse, unintended consequences, and adverse impacts on individuals or society. Risk assessments shall prioritize harm prevention, with regular monitoring of system impacts.",
      "ISO42001": "A.5.2 A.5.3",
      "ISO27001": null,
      "ISO27701": "7.2.3",
      "EU AI ACT": "9.9",
      "NIST RMF": "Map 1.3",
      "SOC2": "CC.3.2",
      "Key control activities": "Implement harm prevention safeguards in the Harm Prevention Framework. - Conduct quarterly harm-focused risk assessments using the Harm Assessment Template. - Monitor system impacts monthly using the Impact Monitoring Tool. - Review harm prevention measures annually using the Harm Prevention Review Protocol.",
      "Required Evidence": "Harm Prevention Framework documentation (PDF format). - Quarterly Harm Assessment Template reports (PDF format). - Monthly Impact Monitoring Tool reports (PDF format). - Annual Harm Prevention Review Protocol reports (PDF format). - Storage: GRC system; Sample size: All harm prevention documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Harm Prevention Framework is documented. - Review the last two quarterly Harm Assessment Template reports. - Examine the last three monthly Impact Monitoring Tool reports. - Confirm the most recent annual Harm Prevention Review Protocol report."
    },
    {
      "Domain": "Safe Responsible AI",
      "Master": "RS-3",
      "Topic": "Robustness",
      "Control Statement": "The organisation shall ensure AI systems demonstrate consistent and reliable performance across their intended operating conditions, including edge cases and unexpected scenarios. Systems must be resilient against errors, adversarial attacks, data quality issues, and feedback loops in continuously learning systems. Regular testing and monitoring shall be conducted to verify robustness, with particular attention to system behavior under stress conditions or when encountering novel situations.",
      "ISO42001": "A.9.4",
      "ISO27001": "A.17.1 A.17.2",
      "ISO27701": "7.2.8",
      "EU AI ACT": "8.1 8.2 15.1 15.4 15.5",
      "NIST RMF": "Map 2.1 Map 2.2 Measure 4.2 Measure 4.3",
      "SOC2": "CC7.1 CC8.1",
      "Key control activities": "Conduct weekly reliability testing using the Reliability Testing Suite. - Perform monthly adversarial testing, including AI-specific threats, using the Adversarial Testing Framework. - Execute quarterly stress testing using the Stress Testing Protocol. - Test edge cases for each system update using the Edge Case Test Suite. - For continuously learning systems, conduct monthly feedback loop testing using the Feedback Loop Testing Framework. - Perform annual resilience assessments using the Resilience Assessment Tool.",
      "Required Evidence": "Weekly Reliability Testing Suite reports (PDF format). - Monthly Adversarial Testing Framework reports (PDF format). - Quarterly Stress Testing Protocol reports (PDF format). - Edge Case Test Suite results for system updates (PDF format). - Monthly Feedback Loop Testing Framework reports for continuously learning systems (PDF format). - Annual Resilience Assessment Tool reports (PDF format). - Storage: Testing repository; Sample size: All robustness documentation for the past 12 months.",
      "Control test plan and procedures": "Review the last four weekly Reliability Testing Suite reports. - Examine the last two monthly Adversarial Testing Framework reports for AI-specific threats. - Verify the most recent quarterly Stress Testing Protocol report. - Confirm Edge Case Test Suite results for one recent system update. - For one continuously learning system, review the last three monthly Feedback Loop Testing Framework reports. - Check the most recent annual Resilience Assessment Tool report."
    },
    {
      "Domain": "Safe Responsible AI",
      "Master": "RS-4",
      "Topic": "Explainability and Interpretability",
      "Control Statement": "The organisation shall ensure AI systems provide explanations of their decisions and outputs that are understandable to intended users and stakeholders. Explainability mechanisms shall be tailored to the system's use case and audience, with regular assessments of explanation effectiveness.",
      "ISO42001": "A.9.3",
      "ISO27001": null,
      "ISO27701": "7.2.4",
      "EU AI ACT": "50.2-50.5",
      "NIST RMF": "Measure 4.1",
      "SOC2": "CC.2.2",
      "Key control activities": "Implement explainability mechanisms using the Explainability Framework. - Tailor explanations to use cases in the Explanation Design Template. - Conduct quarterly explanation effectiveness assessments using the Explanation Effectiveness Survey. - Update explanations for system changes using the Explanation Update Protocol.",
      "Required Evidence": "Explainability Framework documentation (PDF format). - Explanation Design Template for each system (PDF format). - Quarterly Explanation Effectiveness Survey results (PDF format). - Explanation Update Protocol reports (PDF format). - Storage: Compliance system; Sample size: All explainability documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Explainability Framework is implemented for two AI systems. - Review the Explanation Design Template for one system. - Examine the last two quarterly Explanation Effectiveness Survey results. - Confirm Explanation Update Protocol reports for one recent system change."
    },
    {
      "Domain": "Safe Responsible AI",
      "Master": "RS-5",
      "Topic": "Fairness and Non-Discrimination",
      "Control Statement": "The organisation shall implement measures to ensure AI systems operate fairly and do not discriminate against individuals or groups. This includes regular bias assessments, fairness testing, and stakeholder engagement to address potential inequities.",
      "ISO42001": "A.5.4",
      "ISO27001": null,
      "ISO27701": "7.2.5",
      "EU AI ACT": "10.5",
      "NIST RMF": "Map 1.3",
      "SOC2": "CC.3.2",
      "Key control activities": "Implement fairness measures in the Fairness Framework. - Conduct quarterly bias assessments using the Bias Assessment Tool. - Perform fairness testing for each system release using the Fairness Testing Protocol. - Engage stakeholders annually using the Fairness Stakeholder Engagement Protocol.",
      "Required Evidence": "Fairness Framework documentation (PDF format). - Quarterly Bias Assessment Tool reports (PDF format). - Fairness Testing Protocol reports for each release (PDF format). - Annual Fairness Stakeholder Engagement Protocol reports (PDF format). - Storage: Compliance system; Sample size: All fairness documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Fairness Framework is documented. - Review the last two quarterly Bias Assessment Tool reports. - Confirm Fairness Testing Protocol reports for two recent releases. - Examine the most recent annual Fairness Stakeholder Engagement Protocol report."
    },
    {
      "Domain": "Safe Responsible AI",
      "Master": "RS-6",
      "Topic": "Accuracy Metrics",
      "Control Statement": "The organisation shall define, document, and declare accuracy metrics for high-risk AI systems to ensure appropriate performance levels throughout their lifecycle. This includes establishing clear methodologies for measuring accuracy, validating metrics against intended use cases, and disclosing metrics to relevant stakeholders. The organisation shall regularly monitor and update accuracy metrics to maintain compliance with regulatory requirements.",
      "ISO42001": "A.9.4",
      "ISO27001": null,
      "ISO27701": "7.2.8",
      "EU AI ACT": "15.1 15.3 15.4",
      "NIST RMF": "Measure 2.4 Measure 4.2",
      "SOC2": "CC4.1",
      "Key control activities": "Define accuracy metrics for high-risk AI systems before deployment using the Accuracy Metrics Definition Template. - Validate accuracy metrics monthly using the Accuracy Validation Protocol. - Update and disclose accuracy metrics for each system update using the Accuracy Disclosure Form. - Conduct quarterly accuracy compliance reviews using the Accuracy Compliance Checklist. - Reassess accuracy methodologies annually using the Accuracy Methodology Review Framework.",
      "Required Evidence": "Accuracy Metrics Definition Template for each high-risk system (PDF format). - Monthly Accuracy Validation Protocol reports (PDF format). - Accuracy Disclosure Forms for system updates (PDF format). - Quarterly Accuracy Compliance Checklist reports (PDF format). - Annual Accuracy Methodology Review Framework reports (PDF format). - Accuracy metrics tracking logs (Excel format). - Storage: Compliance repository; Sample size: All accuracy documentation for the past 12 months.",
      "Control test plan and procedures": "Verify Accuracy Metrics Definition Templates for two high-risk AI systems. - Review the last three monthly Accuracy Validation Protocol reports. - Confirm Accuracy Disclosure Forms for one recent system update. - Examine the most recent quarterly Accuracy Compliance Checklist report. - Validate accuracy metric calculations for one system output sample. - Check the most recent annual Accuracy Methodology Review Framework report."
    },
    {
      "Domain": "Privacy",
      "Master": "PR-1",
      "Topic": "Privacy by Design and Governance",
      "Control Statement": "The organisation shall integrate privacy by design principles into AI system development and operations, ensuring compliance with data protection regulations. A privacy governance framework shall be established to oversee privacy practices and conduct regular privacy impact assessments.",
      "ISO42001": null,
      "ISO27001": "A.5.1",
      "ISO27701": "6.2.1 6.4.1",
      "EU AI ACT": "10.5",
      "NIST RMF": "Govern 3.2",
      "SOC2": "CC.6.1",
      "Key control activities": "Implement privacy by design in the Privacy by Design Framework. - Document the privacy governance framework in the Privacy Governance Policy. - Conduct quarterly privacy impact assessments using the Privacy Impact Assessment Template. - Review privacy practices annually using the Privacy Review Protocol.",
      "Required Evidence": "Privacy by Design Framework documentation (PDF format). - Privacy Governance Policy (PDF format). - Quarterly Privacy Impact Assessment Template reports (PDF format). - Annual Privacy Review Protocol reports (PDF format). - Storage: Privacy system; Sample size: All privacy documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Privacy by Design Framework is implemented for two AI systems. - Review the Privacy Governance Policy. - Examine the last two quarterly Privacy Impact Assessment Template reports. - Confirm the most recent annual Privacy Review Protocol report."
    },
    {
      "Domain": "Privacy",
      "Master": "PR-2",
      "Topic": "Personal Data Management",
      "Control Statement": "The organisation shall implement processes to manage personal data used by AI systems, ensuring compliance with data minimization, purpose limitation, and data subject rights. Regular audits shall verify adherence to data protection requirements.",
      "ISO42001": null,
      "ISO27001": "A.8.2",
      "ISO27701": "7.3.1 7.3.2",
      "EU AI ACT": null,
      "NIST RMF": null,
      "SOC2": "CC.6.1",
      "Key control activities": "Implement personal data management processes in the Personal Data Management Framework. - Conduct monthly data minimization reviews using the Data Minimization Checklist. - Process data subject requests using the Data Subject Request Protocol. - Perform quarterly data protection audits using the Data Protection Audit Template.",
      "Required Evidence": "Personal Data Management Framework documentation (PDF format). - Monthly Data Minimization Checklist reports (PDF format). - Data Subject Request Protocol logs (PDF format). - Quarterly Data Protection Audit Template reports (PDF format). - Storage: Privacy system; Sample size: All data management documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Personal Data Management Framework is documented. - Review the last three monthly Data Minimization Checklist reports. - Confirm Data Subject Request Protocol logs for two recent requests. - Examine the last two quarterly Data Protection Audit Template reports."
    },
    {
      "Domain": "Privacy",
      "Master": "PR-3",
      "Topic": "Privacy Compliance Monitoring",
      "Control Statement": "The organisation shall continuously monitor compliance with privacy regulations, including GDPR and other applicable laws, through regular assessments and reporting. Non-compliance issues shall be documented and addressed promptly.",
      "ISO42001": null,
      "ISO27001": "A.18.1",
      "ISO27701": "6.5.1",
      "EU AI ACT": null,
      "NIST RMF": null,
      "SOC2": "CC.3.1",
      "Key control activities": "Implement privacy compliance monitoring using the Privacy Compliance Framework. - Conduct monthly compliance assessments using the Privacy Compliance Checklist. - Document non-compliance issues in the Privacy Issue Register. - Review compliance status quarterly using the Privacy Compliance Review Template.",
      "Required Evidence": "Privacy Compliance Framework documentation (PDF format). - Monthly Privacy Compliance Checklist reports (PDF format). - Privacy Issue Register (Excel format). - Quarterly Privacy Compliance Review Template reports (PDF format). - Storage: Compliance system; Sample size: All compliance documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Privacy Compliance Framework is implemented. - Review the last three monthly Privacy Compliance Checklist reports. - Confirm the Privacy Issue Register includes recent issues. - Examine the last two quarterly Privacy Compliance Review Template reports."
    },
    {
      "Domain": "Privacy",
      "Master": "PR-4",
      "Topic": "Privacy Enhancing Technologies",
      "Control Statement": "The organisation shall adopt privacy-enhancing technologies (PETs) to protect personal data used by AI systems, such as anonymization, pseudonymization, and differential privacy. The effectiveness of PETs shall be assessed regularly.",
      "ISO42001": null,
      "ISO27001": "A.8.3",
      "ISO27701": "8.2.3",
      "EU AI ACT": null,
      "NIST RMF": null,
      "SOC2": "CC.6.1",
      "Key control activities": "Implement PETs using the PET Implementation Framework. - Conduct quarterly PET effectiveness assessments using the PET Effectiveness Template. - Document PET configurations in the PET Configuration Register. - Review PET adoption annually using the PET Review Protocol.",
      "Required Evidence": "PET Implementation Framework documentation (PDF format). - Quarterly PET Effectiveness Template reports (PDF format). - PET Configuration Register (Excel format). - Annual PET Review Protocol reports (PDF format). - Storage: Privacy system; Sample size: All PET documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the PET Implementation Framework is documented. - Review the last two quarterly PET Effectiveness Template reports. - Confirm the PET Configuration Register includes configurations for two AI systems. - Examine the most recent annual PET Review Protocol report."
    },
    {
      "Domain": "Assurance and Audit",
      "Master": "AA-1",
      "Topic": "Internal Assessment and Audit",
      "Control Statement": "The organisation shall conduct regular internal assessments and audits of AI systems to verify compliance with regulatory requirements, internal policies, and performance standards. Audit findings shall be documented and addressed through corrective actions.",
      "ISO42001": "9.1 9.2",
      "ISO27001": "9.1 9.2",
      "ISO27701": "6.5.2",
      "EU AI ACT": "17.1 17.2",
      "NIST RMF": "Measure 1.3",
      "SOC2": "CC.4.1",
      "Key control activities": "Conduct monthly internal assessments using the Internal Assessment Framework. - Perform quarterly audits using the Audit Protocol. - Document findings in the Audit Findings Register. - Review audit effectiveness annually using the Audit Effectiveness Template.",
      "Required Evidence": "Internal Assessment Framework reports (PDF format). - Quarterly Audit Protocol reports (PDF format). - Audit Findings Register (Excel format). - Annual Audit Effectiveness Template reports (PDF format). - Storage: Audit system; Sample size: All audit documentation for the past 12 months.",
      "Control test plan and procedures": "Review the last three monthly Internal Assessment Framework reports. - Examine the last two quarterly Audit Protocol reports. - Confirm the Audit Findings Register includes recent findings. - Check the most recent annual Audit Effectiveness Template report."
    },
    {
      "Domain": "Assurance and Audit",
      "Master": "AA-2",
      "Topic": "Independent Assessment and Certification",
      "Control Statement": "The organisation shall ensure regular independent assessments of AI systems are conducted and maintain necessary certifications. Independent assessors must have appropriate expertise and authority to evaluate compliance with regulatory requirements and performance standards. For stand-alone high-risk AI systems, the organisation shall implement self-assessment processes to verify compliance, ensuring alignment with regulatory requirements. The organisation shall obtain and maintain required certifications, track certification status, and implement corrective actions when gaps are identified. Assessment and certification activities must be documented, including findings and evidence of remediation.",
      "ISO42001": "9.1 9.3 10.1 10.2",
      "ISO27001": "9.1 9.3 10.1 10.2 A.18.1 A.18.2",
      "ISO27701": "7.2.1",
      "EU AI ACT": "20.1 22.3-22.4 40.1 43.1-43.4 44.2 44.3",
      "NIST RMF": "Measure 1.3 Measure 4.2 Govern 4.3",
      "SOC2": "CC4.2 CC3.1",
      "Key control activities": "Conduct monthly controls testing using the Internal Controls Testing Framework. - Perform quarterly compliance verification using the Compliance Verification Protocol. - Validate new or significantly changed systems, including self-assessments for stand-alone high-risk systems, using the Self-Assessment Checklist. - Review audit findings semi-annually using the Audit Findings Review Template. - Engage external assessors annually for independent assessments using the External Assessment Protocol.",
      "Required Evidence": "Monthly Internal Controls Testing Framework reports (PDF format). - Quarterly Compliance Verification Protocol reports (PDF format). - Self-Assessment Checklist reports for stand-alone high-risk systems (PDF format). - Semi-annual Audit Findings Review Template reports (PDF format). - Annual External Assessment Protocol reports (PDF format). - Certification tracking logs (Excel format). - Storage: Audit repository; Sample size: All assessment documentation for the past 12 months.",
      "Control test plan and procedures": "Review the last three monthly Internal Controls Testing Framework reports. - Examine the most recent quarterly Compliance Verification Protocol report. - Verify Self-Assessment Checklist reports for two stand-alone high-risk systems. - Review the last semi-annual Audit Findings Review Template report. - Check the most recent annual External Assessment Protocol report. - Confirm certification status in tracking logs."
    },
    {
      "Domain": "Assurance and Audit",
      "Master": "AA-3",
      "Topic": "Safety and Security Validation",
      "Control Statement": "The organisation shall validate the safety and security of AI systems through regular testing and assessments. Validation shall include stress testing, adversarial testing, and compliance with safety and security standards.",
      "ISO42001": "A.9.4",
      "ISO27001": "A.14.2",
      "ISO27701": null,
      "EU AI ACT": "41.1 41.2",
      "NIST RMF": "Measure 4.2",
      "SOC2": "CC7.1",
      "Key control activities": "Conduct monthly stress testing using the Stress Testing Framework. - Perform quarterly adversarial testing using the Adversarial Testing Protocol. - Validate compliance with safety standards using the Safety Validation Checklist. - Review validation effectiveness annually using the Validation Effectiveness Template.",
      "Required Evidence": "Monthly Stress Testing Framework reports (PDF format). - Quarterly Adversarial Testing Protocol reports (PDF format). - Safety Validation Checklist reports (PDF format). - Annual Validation Effectiveness Template reports (PDF format). - Storage: Validation system; Sample size: All validation documentation for the past 12 months.",
      "Control test plan and procedures": "Review the last three monthly Stress Testing Framework reports. - Examine the last two quarterly Adversarial Testing Protocol reports. - Confirm Safety Validation Checklist reports for two AI systems. - Check the most recent annual Validation Effectiveness Template report."
    },

    {
      "Domain": "Operational Monitoring",
      "Master": "OM-1",
      "Topic": "System Performance Monitoring",
      "Control Statement": "The organisation shall continuously monitor AI system performance to ensure operation within defined parameters. Monitoring shall include key performance indicators, anomaly detection, and regular performance reviews.",
      "ISO42001": "9.2 A.6.2.6",
      "ISO27001": "A.12.7",
      "ISO27701": null,
      "EU AI ACT": "15.3",
      "NIST RMF": "Monitor 2.1",
      "SOC2": "CC.7.2",
      "Key control activities": "Implement performance monitoring using the Performance Monitoring Framework. - Define KPIs in the KPI Framework. - Conduct anomaly detection daily using the Anomaly Detection Tool. - Review performance monthly using the Performance Review Template.",
      "Required Evidence": "Performance Monitoring Framework documentation (PDF format). - KPI Framework (PDF format). - Daily Anomaly Detection Tool logs (System logs). - Monthly Performance Review Template reports (PDF format). - Storage: Monitoring system; Sample size: All performance documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Performance Monitoring Framework is implemented for two AI systems. - Review the KPI Framework for defined KPIs. - Confirm daily Anomaly Detection Tool logs for the past week. - Examine the last three monthly Performance Review Template reports."
    },
    {
      "Domain": "Operational Monitoring",
      "Master": "OM-2",
      "Topic": "Event Logging",
      "Control Statement": "The organisation shall maintain comprehensive logs of AI system events and operations throughout their lifecycle. Logging systems must capture relevant operational data including system usage, input data references, and verification of results. For general-purpose AI (GPAI) models, logs shall include details of model interactions and outputs to support transparency and compliance. Logs must be retained for required retention periods, protected from unauthorised access or modification, and made available to authorities when required. The organisation shall ensure logging systems enable effective compliance verification and support incident investigations.",
      "ISO42001": "A.6.2.8",
      "ISO27001": "A.12.6 A.12.7",
      "ISO27701": "12.2.2",
      "EU AI ACT": "12.1-12.3 19.1-19.2 21.2 26.6",
      "NIST RMF": "Govern 4.3",
      "SOC2": "CC7.2 CC7.3",
      "Key control activities": "Configure logging systems to capture system usage, inputs, and outputs daily using the Event Logging Framework. - Review logs weekly for high-risk systems using the Critical System Logging Checklist. - For GPAI models, capture interaction and output details daily using the GPAI Logging Template. - Protect logs with encryption and access controls, audited quarterly using the Log Security Audit Tool. - Verify log retention compliance monthly using the Log Retention Checklist. - Test log accessibility for authorities annually using the Regulatory Access Protocol.",
      "Required Evidence": "Event Logging Framework configuration documentation (PDF format). - Weekly Critical System Logging Checklist reports for high-risk systems (PDF format). - Daily GPAI Logging Template reports (PDF format). - Quarterly Log Security Audit Tool reports (PDF format). - Monthly Log Retention Checklist reports (PDF format). - Annual Regulatory Access Protocol test results (PDF format). - Storage: Secure logging system; Sample size: All logging documentation for the past 12 months.",
      "Control test plan and procedures": "Verify Event Logging Framework configuration for two AI systems. - Review the last four weekly Critical System Logging Checklist reports. - Confirm daily GPAI Logging Template reports for one GPAI model over the past month. - Examine the most recent quarterly Log Security Audit Tool report. - Check the last three monthly Log Retention Checklist reports. - Test log accessibility using the Regulatory Access Protocol."
    },
    {
      "Domain": "Operational Monitoring",
      "Master": "OM-3",
      "Topic": "Continuous Improvement",
      "Control Statement": "The organisation shall implement processes for continuous improvement of AI systems based on monitoring data, stakeholder feedback, and incident analysis. Improvement plans shall be documented and reviewed regularly to ensure effectiveness.",
      "ISO42001": "10.1 10.2",
      "ISO27001": "10.1 10.2",
      "ISO27701": null,
      "EU AI ACT": "72.1",
      "NIST RMF": "Monitor 2.2",
      "SOC2": "CC.8.1",
      "Key control activities": "Implement continuous improvement processes in the Continuous Improvement Framework. - Collect stakeholder feedback quarterly using the Stakeholder Feedback Survey. - Analyze incidents monthly using the Incident Analysis Template. - Review improvement plans semi-annually using the Improvement Plan Review Template.",
      "Required Evidence": "Continuous Improvement Framework documentation (PDF format). - Quarterly Stakeholder Feedback Survey results (PDF format). - Monthly Incident Analysis Template reports (PDF format). - Semi-annual Improvement Plan Review Template reports (PDF format). - Storage: Improvement system; Sample size: All improvement documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Continuous Improvement Framework is documented. - Review the most recent quarterly Stakeholder Feedback Survey results. - Examine the last three monthly Incident Analysis Template reports. - Confirm the last two semi-annual Improvement Plan Review Template reports."
    },

    {
      "Domain": "Third Party & Supply Chain",
      "Master": "TP-1",
      "Topic": "Third-Party Responsibilities",
      "Control Statement": "The organisation shall ensure third-party providers involved in AI system development or operation comply with regulatory and organisational requirements. Contracts shall define responsibilities, and third-party performance shall be monitored regularly.",
      "ISO42001": "8.2",
      "ISO27001": "A.15.1 A.15.2",
      "ISO27701": "15.1.1",
      "EU AI ACT": "25.1-25.3",
      "NIST RMF": "Govern 3.4",
      "SOC2": "CC.9.1",
      "Key control activities": "Document third-party responsibilities in the Third-Party Contract Template. - Conduct quarterly third-party compliance reviews using the Third-Party Compliance Checklist. - Monitor third-party performance monthly using the Third-Party Performance Dashboard. - Review third-party contracts annually using the Contract Review Protocol.",
      "Required Evidence": "Third-Party Contract Template (PDF format). - Quarterly Third-Party Compliance Checklist reports (PDF format). - Monthly Third-Party Performance Dashboard reports (PDF format). - Annual Contract Review Protocol reports (PDF format). - Storage: Vendor management system; Sample size: All third-party documentation for the past 12 months.",
      "Control test plan and procedures": "Verify the Third-Party Contract Template for two third-party providers. - Review the last two quarterly Third-Party Compliance Checklist reports. - Examine the last three monthly Third-Party Performance Dashboard reports. - Confirm the most recent annual Contract Review Protocol report."
    },
    {
      "Domain": "Third Party & Supply Chain",
      "Master": "TP-2",
      "Topic": "Supply Chain Risk Management",
      "Control Statement": "The organisation shall manage risks associated with the AI system supply chain, including third-party components and services. Risk assessments shall be conducted regularly, with mitigation measures implemented and monitored.",
      "ISO42001": "8.2",
      "ISO27001": "A.15.2",
      "ISO27701": "15.2.1",
      "EU AI ACT": "25.1-25.3",
      "NIST RMF": "Map 1.4",
      "SOC2": "CC.9.1",
      "Key control activities": "Conduct quarterly supply chain risk assessments using the Supply Chain Risk Assessment Template. - Implement mitigation measures in the Supply Chain Mitigation Plan. - Monitor mitigation effectiveness monthly using the Mitigation Monitoring Tool. - Review supply chain risks annually using the Supply Chain Risk Review Protocol.",
      "Required Evidence": "Quarterly Supply Chain Risk Assessment Template reports (PDF format). - Supply Chain Mitigation Plan (PDF format). - Monthly Mitigation Monitoring Tool reports (PDF format). - Annual Supply Chain Risk Review Protocol reports (PDF format). - Storage: Risk management system; Sample size: All supply chain documentation for the past 12 months.",
      "Control test plan and procedures": "Review the last two quarterly Supply Chain Risk Assessment Template reports. - Verify the Supply Chain Mitigation Plan for two third-party components. - Examine the last three monthly Mitigation Monitoring Tool reports. - Confirm the most recent annual Supply Chain Risk Review Protocol report."
    },

    {
      "Domain": "Transparency & Communication",
      "Master": "CO-1",
      "Topic": "AI System Transparency",
      "Control Statement": "The organisation shall ensure AI systems are designed and operated with appropriate transparency, enabling users and affected individuals to understand when they are interacting with AI, how the AI system impacts them, and what the system's capabilities and limitations are. This includes clear marking of AI-generated content, disclosure of automated decision-making, and provision of comprehensive documentation about system performance and intended use. For general-purpose AI (GPAI) models, specific transparency measures shall include labeling of generated outputs and disclosure of model capabilities to stakeholders. The organisation must maintain accessibility standards in all transparency communications, provide explanations of AI-driven decisions when required by law, and ensure instructions and documentation are clear and accessible to intended audiences.",
      "ISO42001": "7.4 A.6.2.7 A.8.2 A.9.3 A.9.4",
      "ISO27001": "7.4 A.6.4",
      "ISO27701": "A.7.3.2 A.7.3.3 A.7.3.10 B.8.2.3",
      "EU AI ACT": "13.1-13.3 15.3 50.1-50.5 86.1-86.3",
      "NIST RMF": "Map 1.2 Measure 4.1",
      "SOC2": "CC2.2",
      "Key control activities": "Develop transparency disclosures for AI systems before deployment using the Transparency Disclosure Template. - Conduct monthly user understanding surveys using the Transparency Feedback Survey. - Update transparency documentation for each system update using the Transparency Update Checklist. - For GPAI models, label generated outputs and disclose model capabilities using the GPAI Transparency Framework, reviewed quarterly. - Perform quarterly transparency compliance audits using the Transparency Compliance Protocol. - Ensure accessibility standards (e.g., WCAG 2.1) in transparency communications, verified annually.",
      "Required Evidence": "Transparency Disclosure Template for each AI system (PDF format). - Monthly Transparency Feedback Survey results (PDF format). - Transparency Update Checklist for system updates (PDF format). - Quarterly GPAI Transparency Framework reports (PDF format). - Quarterly Transparency Compliance Protocol reports (PDF format). - Annual accessibility verification reports (PDF format). - Storage: Compliance repository; Sample size: All transparency documentation for the past 12 months.",
      "Control test plan and procedures": "Verify Transparency Disclosure Templates for three AI systems. - Review the last three monthly Transparency Feedback Survey results. - Confirm Transparency Update Checklists for two recent system updates. - Examine the last two quarterly GPAI Transparency Framework reports. - Check the most recent quarterly Transparency Compliance Protocol report. - Verify accessibility compliance for one transparency communication sample."
    },
    {
      "Domain": "Transparency & Communication",
      "Master": "CO-2",
      "Topic": "Stakeholder Engagement",
      "Control Statement": "The organisation shall engage with stakeholders, including users, affected individuals, and regulators, to ensure transparency and trust in AI systems. Engagement shall include regular communication, feedback collection, and incorporation of stakeholder input into system improvements.",
      "ISO42001": "7.3 7.4",
      "ISO27001": "7.3 7.4",
      "ISO27701": "A.7.3.1",
      "EU AI ACT": "4.1",
      "NIST RMF": "Map 1.2",
      "SOC2": "CC.2.3",
      "Key control activities": "Develop a stakeholder engagement plan using the Stakeholder Engagement Framework. - Collect stakeholder feedback quarterly using the Stakeholder Feedback Survey. - Communicate with stakeholders semi-annually using the Stakeholder Communication Template. - Review stakeholder input incorporation annually using the Stakeholder Input Review Protocol.",
      "Required Evidence": "Stakeholder Engagement Framework documentation (PDF format). - Quarterly Stakeholder Feedback Survey results (PDF format). - Semi-annual Stakeholder Communication Template reports (PDF format). -